m = input ('Введіть, ви хочете перекласти з мови чи на мову: ')
if m.title()== 'На':
    a = input ('Введіть мову на яку хочете перекласти (на українській): ')
    n = input ('Введіть слово яке хочете перекласти: ')
    if a.title() == 'Англійська':
        if n.title() == 'Привіт!' or 'Привіт':
            fffffff = 'Hello!'
            print (fffffff)
            aaaaaaaa = input ('Введіть ще одне слово(За бажанням): ')
        elif n.title() == 'Має' or 'Маєш' or 'Маю':
            bbbbbbb = 'Has це коли 3 обличчя а Have коли 2 наприклад: She has ball'
            print (bbbbbbb)
            aaaaaaaa = input ('Введіть ще одне слово(За бажанням): ')
        elif n.title() == 'в стані'or'здатний'or'спроможний':
            x = 'able'
            print (x)
            aaaaaaaa = input ('Введіть ще одне слово(За бажанням): ')
        elif n.title() == 'Про':
            dddddddd = 'about'
            print (dddddddd)
            aaaaaaaa = input ('Введіть ще одне слово(За бажанням): ')
        else:
            print ('Вибачте слова яке ви ввели немає у нашій базі данних. Ми скоро це виправимо!')
    elif a.title() != 'Англійська':
        print ('Вибачте ви ввели неправильну/неіснуючу мову. Перезавантажте сторінку і спробуйте ще раз!')
elif m.title()== 'З':
    v = input ('Введіть мову з якої хочете перекласти (на українській): ')
    f = input ('Введіть слово яке хочете перекласти: ')
    if v.title() == 'Англійська':
        if f.title() == 'Hello' or 'Hey':
            bdddddd = 'Привіт!'
            aaaaaaa = input ('Введіть ще одне слово(За бажанням): ')
            print ('Привіт!')
        elif f.title() == 'You':
            aaaaaaa = input ('Введіть ще одне слово(За бажанням): ')
            baaaaaa = 'Ти/Ви'
            print (baaaaaa)
        else:
            print ('Вибачте слова яке ви ввели немає у нашій базі данних. Ми скоро це виправимо!')
            print ('p.s. Будь ласка надішліть слово', (a.title()),'на електронну адресу servicesvs@icloud.com, ми будемо вам дуже вдячні!!!')
    elif v.title() != 'Англійська':
        print ('Вибачте ви ввели неправильну/неіснуючу мову. Перезавантажте сторінку і спробуйте ще раз!')
else:
    print ('Вибачте, ви ввели неправильний метод. Перезавантажте сторінку і спробуйте ще раз!')
